Hi Anton, 

Sorry for the confusion. Yes, the record has already been created, but when you make changes to another resource that the route53 record depends on it will be force destroyed.



Let me give you some sample code that you can work with and it'll hopefully clear things up. 

Take:
```
module "route53" {
  source = "git@gitlab.ce.com.sss.int:cloud-engineering/terraform/registry-modules/aws/terraform-aws-route53.git//modules/records?ref=v2.10.1"

  zone_id = local.hosted_zones[var.stage]
  private_zone = true

  records = [
    {
      name    = "testrecord"
      type    = var.record_type
      records = ["asdf.ad.my.common.internal.records.int"] # Insert any record here...
      ttl     = var.record_ttl
    }
  ]

depends_on = [
    module.sg
  ]

}

module "sg" {
  source = "git::ssh://git@gitlab.ce.com.sss.int/cloud-engineering/terraform/registry-modules/aws/terraform-aws-security-group.git?ref=v4.3.0"

  name            = "my-route53-test-sg"
  use_name_prefix = false
  description     = "Testing Security Group"
  vpc_id          = "vpc-0000000000" # Insert yours here
  tags = merge(
    {
      "Name" = "my-route53-test-sg"
    }
  )

}
```

The depends on part is important here. Once you have applied the above code, if you make a simple change to the sg it'll force the lookup to be done on the zone_id again forcing the recreation of the route53 record. Use the below as an example:

```
module "route53" {
  source = "git@gitlab.ce.com.sss.int:cloud-engineering/terraform/registry-modules/aws/terraform-aws-route53.git//modules/records?ref=v2.10.1"

  zone_id = local.hosted_zones[var.stage]
  private_zone = true

  records = [
    {
      name    = "testrecord"
      type    = var.record_type
      records = ["asdf.ad.my.common.internal.records.int"] # Insert any record here...
      ttl     = var.record_ttl
    }
  ]

depends_on = [
    module.sg
  ]

}

module "sg" {
  source = "git::ssh://git@gitlab.ce.com.sss.int/cloud-engineering/terraform/registry-modules/aws/terraform-aws-security-group.git?ref=v4.3.0"

  name            = "my-route53-test-sg"
  use_name_prefix = false
  description     = "Testing Security Group"
  vpc_id          = "vpc-0000000000" # Insert yours here
  tags = merge(
    {
      "Name" = "my-route53-test-sg"
      "test" = "test"
    }
  )

}
```

You can see the apply plan here:
```
~/Documents/git_repos2/personal/route53-test  aws:() 
❯ terraform-1.0.2 apply -var-file=vars/vars.tfvars
module.sg.aws_security_group.this[0]: Refreshing state... [id=sg-0123456678]
module.route53.aws_route53_record.this["testrecord CNAME"]: Refreshing state... [id=Z0123423599758_testrecord.dmi.dev.sss.int_CNAME]

Terraform used the selected providers to generate the following execution plan. Resource actions are indicated with the following symbols:
  ~ update in-place
-/+ destroy and then create replacement
 <= read (data resources)

Terraform will perform the following actions:

  # module.route53.data.aws_route53_zone.this[0] will be read during apply
  # (config refers to values not yet known)
 <= data "aws_route53_zone" "this"  {
      ~ arn                        = "arn:aws:route53:::hostedzone/Z0123423599758" -> (known after apply)
      ~ caller_reference           = "terraform-20200402162825661200000001" -> (known after apply)
      ~ comment                    = "Private Hosted Zone" -> (known after apply)
      ~ id                         = "Z0123423599758" -> (known after apply)
      + linked_service_description = (known after apply)
      + linked_service_principal   = (known after apply)
      ~ name                       = "my.dev.internal.records.int" -> (known after apply)
      ~ name_servers               = [
          - "ns-0.awsdns-00.com.",
          - "ns-1024.awsdns-00.org.",
          - "ns-1536.awsdns-00.co.uk.",
          - "ns-512.awsdns-00.net.",
        ] -> (known after apply)
      ~ primary_name_server        = "ns-0.awsdns-00.com." -> (known after apply)
      ~ resource_record_set_count  = 12 -> (known after apply)
      ~ tags                       = {
          - "Key"             = "Value"
          - "Key"         = "Value"
        } -> (known after apply)
      + vpc_id                     = (known after apply)
        # (2 unchanged attributes hidden)
    }

  # module.route53.aws_route53_record.this["testrecord CNAME"] must be replaced
-/+ resource "aws_route53_record" "this" {
      ~ fqdn            = "testrecord.dmi.dev.sss.int" -> (known after apply)
      ~ id              = "Z0123423599758_testrecord.dmi.dev.sss.int_CNAME" -> (known after apply)
      ~ name            = "testrecord.dmi.dev.sss.int" -> (known after apply) # forces replacement
        # (5 unchanged attributes hidden)
    }

  # module.sg.aws_security_group.this[0] will be updated in-place
  ~ resource "aws_security_group" "this" {
        id                     = "sg-0123456678"
        name                   = "my-route53-test-sg"
      ~ tags                   = {
          + "test" = "test"
            # (1 unchanged element hidden)
        }
      ~ tags_all               = {
          + "test" = "test"
            # (1 unchanged element hidden)
        }
        # (7 unchanged attributes hidden)
    }

Plan: 1 to add, 1 to change, 1 to destroy.

Do you want to perform these actions?
  Terraform will perform the actions described above.
  Only 'yes' will be accepted to approve.

  Enter a value:
```

Adding in your suggestion of `full_name_override = true` does fix this, I wasn't aware of this feature.

```
module "route53" {
  source = "git@gitlab.ce.com.sss.int:cloud-engineering/terraform/registry-modules/aws/terraform-aws-route53.git//modules/records?ref=v2.10.1"

  zone_id = local.hosted_zones[var.stage]
  private_zone = true

  records = [
    {
      name    = "testrecord.my.dev.internal.records.int"
      full_name_override = true
      type    = var.record_type
      records = ["asdf.ad.my.common.internal.records.int"] # Insert any record here...
      ttl     = var.record_ttl
    }
  ]

depends_on = [
    module.sg
  ]

}

module "sg" {
  source = "git::ssh://git@gitlab.ce.com.sss.int/cloud-engineering/terraform/registry-modules/aws/terraform-aws-security-group.git?ref=v4.3.0"

  name            = "my-route53-test-sg"
  use_name_prefix = false
  description     = "Testing Security Group"
  vpc_id          = "vpc-0000000000" # Insert yours here
  tags = merge(
    {
      "Name" = "my-route53-test-sg"
      "test" = "test"
    }
  )

}
```

```
❯ terraform-1.0.2 apply -var-file=vars/vars.tfvars
module.sg.aws_security_group.this[0]: Refreshing state... [id=sg-0123456678]
module.route53.aws_route53_record.this["testrecord.my.dev.internal.records.int CNAME"]: Refreshing state... [id=Z0123423599758_testrecord.my.dev.internal.records.int_CNAME]

Terraform used the selected providers to generate the following execution plan. Resource actions are indicated with the following symbols:
  ~ update in-place
 <= read (data resources)

Terraform will perform the following actions:

  # module.route53.data.aws_route53_zone.this[0] will be read during apply
  # (config refers to values not yet known)
 <= data "aws_route53_zone" "this"  {
      ~ arn                        = "arn:aws:route53:::hostedzone/Z0123423599758" -> (known after apply)
      ~ caller_reference           = "terraform-20200402162825661200000001" -> (known after apply)
      ~ comment                    = "Private Hosted Zone" -> (known after apply)
      ~ id                         = "Z0123423599758" -> (known after apply)
      + linked_service_description = (known after apply)
      + linked_service_principal   = (known after apply)
      ~ name                       = "my.dev.internal.records.int" -> (known after apply)
      ~ name_servers               = [
          - "ns-0.awsdns-00.com.",
          - "ns-1024.awsdns-00.org.",
          - "ns-1536.awsdns-00.co.uk.",
          - "ns-512.awsdns-00.net.",
        ] -> (known after apply)
      ~ primary_name_server        = "ns-0.awsdns-00.com." -> (known after apply)
      ~ resource_record_set_count  = 12 -> (known after apply)
      ~ tags                       = {
          - "Key"             = "Value"
          - "Key"         = "Value"
        } -> (known after apply)
      + vpc_id                     = (known after apply)
        # (2 unchanged attributes hidden)
    }

  # module.sg.aws_security_group.this[0] will be updated in-place
  ~ resource "aws_security_group" "this" {
        id                     = "sg-0123456678"
        name                   = "my-route53-test-sg"
      ~ tags                   = {
          + "test" = "test"
            # (1 unchanged element hidden)
        }
      ~ tags_all               = {
          + "test" = "test"
            # (1 unchanged element hidden)
        }
        # (7 unchanged attributes hidden)
    }

Plan: 0 to add, 1 to change, 0 to destroy.

Do you want to perform these actions?
  Terraform will perform the actions described above.
  Only 'yes' will be accepted to approve.

  Enter a value: 
```